###Relational Databases:
    -Posgre SQL, (this one)
    - MySQL, and 
    - SQLite

####TABLE BASICS

- Every database has a SCHEMA: defines the structure of the database 
- Each have different DATA TYPE : integer, string (varchar), date   
- PRIMARY KEY uniquely idetifies an entry 

```sql
CREATE TABLE users {
  id INTEGER PRIMARY KEY,
  name VARCHAR(255),
  age INTEGER,
  city VARCHAR(255),
  state VARCHAR(2)
}
```

####FOREIGN KEYS
- columns that refrence a different entry in the database: same or different table
- in this example, everytime a user visits a website, an entry is put in the visits table. 
- you can see that we tell it here that this user_id is connected to id in the users table.
```sql
CREATE TABLE visits {
  id INTEGER PRIMARY KEY,
  created_at TIMESTAMP,
  user_id INTEGER REFERENCES users(id)
}
```

##TO START SQLite3
Easy:
$sqlite3 directoryname.sqlite

Once in, basic commands:
 - .header on
 - .tables
 - .schema directoryname

##TO START POSTGRESS

    1) start postgress in your computer
    2) go to Bash, and run psql by typing 'psql'
    3) create an empty database to load your database into
```sql
CREATE DATABASE databasename;
\q
```
    4) Go to where the .sql file is and type:
 ```sql
psql databasename < databasename.sql
```
    5) Now we are in the command client. so, enter it by:
   
 ```sql
psql databasename
```

    6) Wanna see the tables?  \d
    7) wanna see the columns for tabels?  \d tabelname

In [2]:
import sqlite3 as sql
def run_sql_query(command, db):
    if not command:
        return []
    con = sql.connect(db)
    c = con.cursor()
    data = c.execute(command)
    result = [d for d in data]
    con.close()
    return result

## Keyword Cheatsheet

* Return values
  * SELECT
  * DISTINCT
* Tables and rows
  * FROM
  * JOIN
    * INNER
    * LEFT, RIGHT
    * FULL
* Filtering
  * WHERE
  * =, !=, >, <, >=, <=
  * AND, OR
  * IN, NOT IN
  * LIKE
  * IS NULL, IS NOT NULL
  * LIMIT
  * BETWEEN
* Aggregating
  * GROUP BY
  * COUNT
  * MAX, MIN
  * SUM
  * AVG
  * HAVING
* Ordering
  * ORDER BY
* Aliasing
  * AS

cool resource:
    http://blog.yhathq.com/posts/sql-for-data-scientists.html

####date tips for postgress:
    date_trunc, to_char, and to_timestamp can take you a pretty long way in terms for formatting and type conversion. For extracting certain values from a date (say the day of the week) you can use date_part.

```sql
select
    date_trunc('year', '2013-04-05'::date) as year
    , date_trunc('month', '2013-04-05'::date) as month
    , date_trunc('day', '2013-04-05'::date) as day;
 
--          year          |         month          |          day           
--------------------------+------------------------+------------------------
-- 2013-01-01 00:00:00-05 | 2013-04-01 00:00:00-04 | 2013-04-05 00:00:00-04

select
    to_char('2013-04-05'::date, 'YYYY') as year
    , to_char('2013-04-05'::date, 'MM-YYYY') as month
    , to_char('2013-04-05'::date, 'YYYYMMDD') as day;

-- year |  month  |   day    
--------+---------+----------
-- 2013 | 04-2013 | 20130405
 
select
    to_timestamp(1365560673);
--      to_timestamp      
------------------------
-- 2013-04-09 22:24:33-04

select date_part('day', '2013-04-05'::date);

-- date_part 
-------------
--         5

select date_part('second', to_timestamp(1365560673));

--date_part 
-------------
--        33
```


SELECT type, AVG(price) as averageprice, MIN(price), MAX(price) 
FROM meals 
GROUP BY type;

SELECT meal_id, 
	SUM(CASE WHEN event = 'bought' THEN 1 ELSE 0 END) as bought, 
	SUM(CASE WHEN event = 'like' THEN 1 ELSE 0 END) as like,
	SUM(CASE WHEN event = 'share' THEN 1 ELSE 0 END) as share,
FROM events
GROUP BY meal_id;
    type    |    averageprice     | min | max
------------+---------------------+-----+-----
 mexican    |  9.6975945017182131 |   6 |  13
 french     | 11.5420000000000000 |   7 |  16
 japanese   |  9.3804878048780488 |   6 |  13
 italian    | 11.2926136363636364 |   7 |  16
 chinese    |  9.5187165775401070 |   6 |  13
 vietnamese |  9.2830188679245283 |   6 |  13
(6 rows)

##Temporary Tabels:

WITH t1 AS (
    SELECT COUNT(event), EXTRACT(DOW FROM dt) AS day
    FROM events
    WHERE event = 'bought'
    GROUP BY EXTRACT(DOW FROM dt)
    )
SELECT day
FROM t1 JOIN (SELECT MAX(count) as max
              FROM t1
              ) AS t2
ON t1.count = t2.max;

In [6]:
import numpy as np

In [ ]:
np.where()